# HVACLoadSpaceType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
HVACLoadSpaceType Class
Members See Also
---
The type element of space.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class HVACLoadSpaceType : HVACLoadType
```

Visual Basic
---
```text
Public Class HVACLoadSpaceType _
	Inherits HVACLoadType
```

Visual C++
---
```text
public ref class HVACLoadSpaceType : public HVACLoadType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..HVACLoadType Autodesk.Revit.DB.Analysis..::..HVACLoadSpaceType
# See Also
HVACLoadSpaceType Members
Autodesk.Revit.DB.Analysis Namespace